#language: ru

@tree
@ExportScenarios

Функционал: Проверка значений по умолчанию: закладка Стропы

Сценарий: Проверка значений по умолчанию: закладка Стропы
	Тогда значение поля с именем "ВидСтропСтрокой" содержит текст "Ленточные;"
	Тогда значение поля с именем "ГрузоподъемностьЛенточныеСтропы" содержит текст "1500"
	Тогда значение поля с именем "ВариантПришиваЛенточныхСтропы" содержит текст "4 стропы (стандарт)"
	Тогда значение поля с именем "ШиринаСтропы" содержит текст "5"
	Тогда значение поля с именем "ЦветСтропы4Стропы" содержит текст "Белый"
	Тогда значение поля с именем "УхоСверхуРазмер4Стропы" содержит текст "30"
	Тогда значение поля с именем "ДлинаСтропы4Стропы" содержит текст "2/3 к 1/3"
	Тогда значение поля с именем "ПришивСтропыДоВерха4Стропы" содержит текст "Отступ 5 см"
	Тогда значение поля с именем "Удлиннение" содержит текст "Нет"
	Тогда значение поля с именем "УхоСнизуКоличество4Стропы" содержит текст "0"
